Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationDirection Property
 The ExaggerationDirection.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.ExaggerationDirections ExaggerationDirection { get; set; }
Public Property ExaggerationDirection As DimensionSetBaseAttributes.ExaggerationDirections
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.ExaggerationDirections
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
Tekla.Structures.Drawing Namespace